AK47n/firstep/library/masters/mspm0/mspm0.syscfg
// ADS1115 四通道 16bit 外扩 ADC（ads1115 模块：软 I2C 位操作 2 脚 SCL/SDA——
// 照 AHT10 先例不占硬件 I2C 外设；SDA 方向运行时切换（写 = 输出、读 ACK = 输入）。
// 默认 SCL=PA16 / SDA=PA17——与 DC_MOTOR 编码器 AA/AB、RC522 MOSI/MISO 重叠：
// 外扩多通道 ADC 与双电机闭环车/读卡门禁同选概率最低（与库内 adc 板载 12bit
// 单通道分工不同：adc = 板载 ADC12_0 MEM0（默认 PA24，us016 共读同槽），多路
// 模拟量/分离供电用本件——两件同选互不冲突），同选时经引脚绑定消解；
// 软 I2C 需板上/模块自带上拉）
const ADS1115 = GPIO.addInstance();
ADS1115.$name = "ADS1115";
ADS1115.associatedPins.create(2);
ADS1115.associatedPins[0].$name        = "SCL";
ADS1115.associatedPins[0].direction    = "OUTPUT";
ADS1115.associatedPins[0].initialValue = "CLEARED";
ADS1115.associatedPins[0].pin.$assign  = "PA16";
ADS1115.associatedPins[1].$name        = "SDA";
ADS1115.associatedPins[1].direction    = "OUTPUT";
ADS1115.associatedPins[1].initialValue = "CLEARED";
ADS1115.associatedPins[1].pin.$assign  = "PA17";

// TCS34725 颜色识别（tcs34725 模块：软 I2C 位操作 2 脚 SCL/SDA——照 AHT10 先例
// 不占硬件 I2C 外设；SDA 方向运行时切换（写 = 输出、读 ACK = 输入）。默认
// SCL=PA23 / SDA=PA24——与 HUIDU L2/L3、UWB/DEBUG/HC05 UART（PA23/PA24）、
// NRF24L01 CSN/CE、ADC12_0 MEM0（adc+us016 共享槽）重叠：颜色识别与无线
// 链路/巡线/板载 ADC 同选概率最低（颜色识别属视觉类，与 K230 视觉互替；
// 刻意不叠 OLED PB2/PB3/MAX7219 显示件——显示颜色值是常见搭配），同选时
// 经引脚绑定消解；软 I2C 需板上/模块自带上拉）
const TCS34725 = GPIO.addInstance();
TCS34725.$name = "TCS34725";
TCS34725.associatedPins.create(2);
TCS34725.associatedPins[0].$name        = "SCL";
TCS34725.associatedPins[0].direction    = "OUTPUT";
TCS34725.associatedPins[0].initialValue = "CLEARED";
TCS34725.associatedPins[0].pin.$assign  = "PA23";
TCS34725.associatedPins[1].$name        = "SDA";
TCS34725.associatedPins[1].direction    = "OUTPUT";
TCS34725.associatedPins[1].initialValue = "CLEARED";
TCS34725.associatedPins[1].pin.$assign  = "PA24";

// MLX90614 非接触红外测温（mlx90614 模块：软 I2C/SMBus 兼容位操作 2 脚
// SCL/SDA——照 AHT10 先例不占硬件 I2C 外设；SDA 方向运行时切换（写 = 输出、
// 读 ACK = 输入）。默认 SCL=PA9 / SDA=PA8——与 DIGIT_UART RX/TX（K230 视觉）、
// IR_BEAM OUT、HC05 STATE、JOYSTICK SW、NRF24L01 MISO 重叠：非接触测温与
// 视觉（K230 互替类）/手动输入/蓝牙/2.4G 链路同选概率最低（刻意不叠
// 温湿度/光照/显示——测温与传感站/显示为常见搭配），同选时经引脚绑定
// 消解；软 I2C 需板上/模块自带上拉（SMBus 上拉 4.7k~10k，模块板自带））
const MLX90614 = GPIO.addInstance();
MLX90614.$name = "MLX90614";
MLX90614.associatedPins.create(2);
MLX90614.associatedPins[0].$name        = "SCL";
MLX90614.associatedPins[0].direction    = "OUTPUT";
MLX90614.associatedPins[0].initialValue = "CLEARED";
MLX90614.associatedPins[0].pin.$assign  = "PA9";
MLX90614.associatedPins[1].$name        = "SDA";
MLX90614.associatedPins[1].direction    = "OUTPUT";
MLX90614.associatedPins[1].initialValue = "CLEARED";
MLX90614.associatedPins[1].pin.$assign  = "PA8";

// AT24C02 EEPROM 存储（at24c02 模块：软 I2C 位操作 2 脚 SCL/SDA——照 AHT10
// 先例不占硬件 I2C 外设；SDA 方向运行时切换（写 = 输出、读 ACK = 输入）。
// 默认 SCL=PB24 / SDA=PB8——与 STEP_MOTOR RST2/DCY2、SR04 TRIG/ECHO、
// HC05 KEY 重叠：EEPROM 存储记录与步进/测距同选概率最低（记录类与运动类
// 不同框；记录+传感站类同选时与同批 ads1115/tcs34725/mlx90614 默认不撞），
// 同选时经引脚绑定消解；软 I2C 需板上/模块自带上拉）
const AT24C02 = GPIO.addInstance();
AT24C02.$name = "AT24C02";
AT24C02.associatedPins.create(2);
AT24C02.associatedPins[0].$name        = "SCL";
AT24C02.associatedPins[0].direction    = "OUTPUT";
AT24C02.associatedPins[0].initialValue = "CLEARED";
AT24C02.associatedPins[0].pin.$assign  = "PB24";
AT24C02.associatedPins[1].$name        = "SDA";
AT24C02.associatedPins[1].direction    = "OUTPUT";
AT24C02.associatedPins[1].initialValue = "CLEARED";
AT24C02.associatedPins[1].pin.$assign  = "PB8";

// SHT30 温湿度软 I2C（sht30 模块：SCL 输出 / SDA 双向运行时切换；
// 位操作不占硬件 I2C 外设，照 AHT10 先例——半周期 5us ≈ 100kHz 级。
// 默认 SCL=PA28 / SDA=PA31——与 IMU601 UART0（+FINGERPRINT_UART）、
// HX711 SCK/DT 重叠：温湿度与姿态/称重/身份采集不同框、同选概率最低
// （刻意不叠 PB6/PB7——aht10 温湿度互替；不叠批次 5 八脚），同选时经引脚
// 绑定消解；软 I2C 需板上/模块自带上拉）
const SHT30 = GPIO.addInstance();
SHT30.$name = "SHT30";
SHT30.associatedPins.create(2);
SHT30.associatedPins[0].$name        = "SCL";
SHT30.associatedPins[0].direction    = "OUTPUT";
SHT30.associatedPins[0].initialValue = "CLEARED";
SHT30.associatedPins[0].pin.$assign  = "PA28";
SHT30.associatedPins[1].$name        = "SDA";
SHT30.associatedPins[1].direction    = "OUTPUT";
SHT30.associatedPins[1].initialValue = "CLEARED";
SHT30.associatedPins[1].pin.$assign  = "PA31";

// SGP30 空气 TVOC/CO2e 气体传感（sgp30 模块：软 I2C 位操作 2 脚 SCL/SDA——
// 照 AHT10 先例不占硬件 I2C 外设；SDA 方向运行时切换（写 = 输出、读 ACK =
// 输入）。默认 SCL=PA18 / SDA=PB9——与 DC_MOTOR AIN2/AIN1（双电机）、
// MAX7219 CLK/DIN（大数字显示）、RC522 RST（读卡门禁）重叠：气体传感与
// 运动控制/读卡门禁不同框、同选概率最低（刻意不叠温湿度（AHT10 PB6/PB7、
// DHT11 PB7、DS18B20 PA7、SHT30 PA28/PA31）、光照（PA12/PA13）、OLED 显示
// （PB2/PB3）、语音（PB19/PB20）、按键（PA2、PA22-27）、报警（PA15）、无线
// （PA8/PA9/PA23/PA24）与批次 5 八脚——气体检测器标配温湿度+显示+蜂鸣/灯+
// 键盘，同选概率最高故避开），同选时经引脚绑定消解；软 I2C 需板上/模块
// 自带上拉）
const SGP30 = GPIO.addInstance();
SGP30.$name = "SGP30";
SGP30.associatedPins.create(2);
SGP30.associatedPins[0].$name        = "SCL";
SGP30.associatedPins[0].direction    = "OUTPUT";
SGP30.associatedPins[0].initialValue = "CLEARED";
SGP30.associatedPins[0].pin.$assign  = "PA18";
SGP30.associatedPins[1].$name        = "SDA";
SGP30.associatedPins[1].direction    = "OUTPUT";
SGP30.associatedPins[1].initialValue = "CLEARED";
SGP30.associatedPins[1].pin.$assign  = "PB9";

// AGS10 有害气体（TVOC）传感（ags10 模块：软 I2C 位操作 2 脚 SCL/SDA——
// 照 AHT10 先例不占硬件 I2C 外设；SDA 方向运行时切换（写 = 输出、读 ACK =
// 输入）。默认 SCL=PB18 / SDA=PA14——与 DC_MOTOR BIN1（双电机）、MAX7219 CS
// （大数字显示）、DCC_100_PWM2（step_motor 步进脉冲——风机排烟联动）、
// WS2812 IN（灯带指示）、RC522 SCK（读卡门禁）重叠：气体传感与运动控制/读卡/
// 灯带低频同框、同选概率最低（避让原则同 SGP30：不叠温湿度/光照/OLED/语音/
// 按键/报警/无线/批次 5 八脚），同选时经引脚绑定消解；软 I2C 需板上/模块
// 自带上拉）
const AGS10 = GPIO.addInstance();
AGS10.$name = "AGS10";
AGS10.associatedPins.create(2);
AGS10.associatedPins[0].$name        = "SCL";
AGS10.associatedPins[0].direction    = "OUTPUT";
AGS10.associatedPins[0].initialValue = "CLEARED";
AGS10.associatedPins[0].pin.$assign  = "PB18";
AGS10.associatedPins[1].$name        = "SDA";
AGS10.associatedPins[1].direction    = "OUTPUT";
AGS10.associatedPins[1].initialValue = "CLEARED";
AGS10.associatedPins[1].pin.$assign  = "PA14";

// TTP224 4 路电容触摸按键（ttp224 模块：OUT1-4 输入 + 内部上拉——页面
// 「上拉输入」；电平直读无去抖/无 GPIO 中断（GROUP1 仍被 motor 编码器独占，
// 页面同为电平直读）。默认 OUT1=PA22 / OUT2=PA25 / OUT3=PA26 / OUT4=PA27——
// 与 HUIDU L1/L4/R1/R2（巡线）、DEBUG_UART RX/NRF24L01 IRQ、ZIGBEE_UART/
// joystick X-Y/IR_REMOTE/ADC12_0 MEM3（ir_distance）重叠：触摸按键与无线
// 链路/手动输入互替、与巡线/测距不同框，同选概率最低；四脚与同批默认
// （PA7/PA28/PA31/PA24）不撞，同选时经引脚绑定消解）
const TTP224 = GPIO.addInstance();
TTP224.$name = "TTP224";
TTP224.associatedPins.create(4);
TTP224.associatedPins[0].$name            = "OUT1";
TTP224.associatedPins[0].direction        = "INPUT";
TTP224.associatedPins[0].internalResistor = "PULL_UP";
TTP224.associatedPins[0].pin.$assign      = "PA22";
TTP224.associatedPins[1].$name            = "OUT2";
TTP224.associatedPins[1].direction        = "INPUT";
TTP224.associatedPins[1].internalResistor = "PULL_UP";
TTP224.associatedPins[1].pin.$assign      = "PA25";
TTP224.associatedPins[2].$name            = "OUT3";
TTP224.associatedPins[2].direction        = "INPUT";
TTP224.associatedPins[2].internalResistor = "PULL_UP";
TTP224.associatedPins[2].pin.$assign      = "PA26";
TTP224.associatedPins[3].$name            = "OUT4";
TTP224.associatedPins[3].direction        = "INPUT";
TTP224.associatedPins[3].internalResistor = "PULL_UP";
TTP224.associatedPins[3].pin.$assign      = "PA27";

