AK47n/firstep/library/masters/mspm0/mspm0.syscfg
// adc 模块 + 摇杆 + 模拟量测距 + 气体传感 + 火焰/土壤传感共享 ADC12_0（b1-adc-servo/01 +
// wiki-modules-batch1/01 + wiki-modules-batch2/02/04 +
// wiki-modules-batch7/01/02 + wiki-modules-batch8/01/02：
// MEM0=PA24/A0_3 归 adc（us016/mq2 薄封装共读同槽——wiki-modules-batch2/02
// 与 batch6/03），MEM1=PA26/A0_1、
// MEM2=PA25/A0_2 归 joystick X/Y，MEM3=PA27/A0_0 归 ir_distance 红外测距
// （手册原脚），MEM4=PB20/A0_6 归 mq135、MEM5=PB24/A0_5 归 mq5（独立通道
// ——与 mq2 的 MEM0 薄封装不同：多路气体同选时各器件物理通道独立、无共读
// 冲突；2026-09-08 SysConfig CLI 实证 MEM4-7 通道/脚全合法），MEM6=PA22/A0_7
// 归 flame 火焰传感（独立通道——火焰 AO 为高阻电流源，取剩余通道中唯一
// 无负载脚 PA22；与 HUIDU L1/DEBUG_UART RX/NRF24L01 IRQ/TTP224 OUT1 重叠，
// 与巡线/无线/触摸不同框、同选概率最低），MEM7=PA14/A0_12 归 soil 土壤湿度
// （独立通道——**MEM 槽位已满（8/8）**：后续 ADC 类件（photoresistance/rain/
// gp2y1014au/s12sd/ms1100）一律薄封装共读 MEM0（mq2/us016 先例——多件同选
// 同读一物理通道、一次转换一次读、采样节奏按用途自协调）；PA14 板载
// LED2+15k 为固定比率衰减（读数系统偏小、单调性保留），与 DCC_100_PWM2/
// WS2812 IN/RC522 SCK/AGS10 SDA 重叠——浇花/智慧农业与运动/读卡/气体不同框、
// 同选概率最低）；
// 轮询读取不配
// 中断。多 MEM 必须 sequence 模式（startAdd..endAdd = 启用 MEM 集合）——
// 单发模式只启用 startAdd 槽位，adcPin1/2 由此不可用（原注释「槽位不存在」
// 系误判，2026-09-05 SysConfig CLI 实证）
const ADC12   = scripting.addModule("/ti/driverlib/ADC12", {}, false);
const ADC12_0 = ADC12.addInstance();
ADC12_0.$name                      = "ADC12_0";
ADC12_0.sampClkSrc                 = "DL_ADC12_CLOCK_ULPCLK";
ADC12_0.sampClkDiv                 = "DL_ADC12_CLOCK_DIVIDE_8";
ADC12_0.sampleTime0                = "125 us";
ADC12_0.powerDownMode              = "DL_ADC12_POWER_DOWN_MODE_MANUAL";
ADC12_0.adcMem0chansel             = "DL_ADC12_INPUT_CHAN_3";
ADC12_0.adcMem1chansel             = "DL_ADC12_INPUT_CHAN_1";
ADC12_0.adcMem2chansel             = "DL_ADC12_INPUT_CHAN_2";
ADC12_0.adcMem3chansel             = "DL_ADC12_INPUT_CHAN_0";
ADC12_0.adcMem4chansel             = "DL_ADC12_INPUT_CHAN_6";
ADC12_0.adcMem5chansel             = "DL_ADC12_INPUT_CHAN_5";
ADC12_0.adcMem6chansel             = "DL_ADC12_INPUT_CHAN_7";
ADC12_0.adcMem7chansel             = "DL_ADC12_INPUT_CHAN_12";
ADC12_0.samplingOperationMode      = "sequence";
ADC12_0.startAdd                   = 0;
ADC12_0.endAdd                     = 7;
ADC12_0.peripheral.$assign         = "ADC0";
ADC12_0.peripheral.adcPin3.$assign = "PA24";
ADC12_0.peripheral.adcPin1.$assign  = "PA26";
ADC12_0.peripheral.adcPin2.$assign  = "PA25";
ADC12_0.peripheral.adcPin0.$assign = "PA27";
ADC12_0.peripheral.adcPin6.$assign = "PB20";
ADC12_0.peripheral.adcPin5.$assign = "PB24";
ADC12_0.peripheral.adcPin7.$assign = "PA22";
ADC12_0.peripheral.adcPin12.$assign = "PA14";
const Board = scripting.addModule("/ti/driverlib/Board", {}, false);
Board.configureUnused = true;

SYSCTL.forceDefaultClkConfig = true;
SYSCTL.clockTreeEn  = true;
